Update architecture diagram to use mermaid format
Signed-off-by: Henri DELEMAZURE <93766722+Ritonton@users.noreply.github.com>
